# Каждый следующий элемент ряда Фибоначчи получается при сложении двух предыдущих. Начиная с 1 и 2,
# первые 10 элементов будут: 1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
# Найдите сумму всех четных элементов ряда Фибоначчи, которые не превышают четыре миллиона.

def start():
    a = 0
    b = 1
    c = 0

    while True:
        if a + b > 4000000:
            break
        a = a + b
        b = a + b
        if not a % 2 > 0:
            c += a
        if not b % 2 > 0:
            c += b
    print(c)
