import sys

print('\nПростые делители числа 13195 - это 5, 7, 13 и 29.\
    Каков самый большой делитель числа 600851475143, являющийся простым числом?')

y = 600851475143
a = int((y ** 0.5) + 1)  # Получаем корень из предоставленного числа, что бы уменьшить количество итераций
z = 0

def proverka(n):  # Функция проверки числа на "простоту"
    d = 2
    while n % d != 0:
        d += 1
    return d == n

for i in sys.xrange(a, 2, -2):  # Цикл поиска делителей. Запущен в обратном порядке, что бы найти наибольшее.
    # Шаг 2, что бы пропускать четные числа. До двух, потому, что 1 не является простым числом
    if y % i == 0:  # Если деление произошло без остатка, отправляем делитель на проверку "простоты"
        if proverka(i):
            z = i
            break
print("Ответ:", z)
